# Brewfile
# brew bundle install でまとめてインストール可能
# brew bundle dump --force で現在の環境からの更新も可能

# ============================================================
# Taps
# ============================================================
tap "FelixKratz/formulae"  # borders
tap "nikitabobko/tap"      # aerospace

# ============================================================
# Formulae (CLI ツール)
# ============================================================

## シェル・ターミナル環境
brew "sheldon"  # zsh プラグインマネージャー
brew "deno"     # zeno.zsh の必須依存
brew "fzf"      # ファジーファインダー
brew "zoxide"   # 賢い cd コマンド
brew "atuin"    # シェル履歴の強化
brew "yazi"     # ターミナルファイルマネージャー
brew "zellij"   # ターミナルマルチプレクサ

## バージョン管理
brew "git"
brew "ghq"      # リポジトリ管理ツール
brew "lazygit"  # git TUI クライアント
brew "gh"       # GitHub CLI

## エディタ・開発ツール
brew "neovim"
brew "mise"     # ランタイムバージョンマネージャー（asdf 互換）

## ウィンドウ装飾
brew "borders"  # ウィンドウボーダー（AeroSpace 連携）

# ============================================================
# Casks (GUI アプリ)
# ============================================================
cask "aerospace" # タイリングウィンドウマネージャー
cask "wezterm"   # ターミナルエミュレータ
